app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.for(current_user).all

INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 09 May 2013 06:32:47 UTC +00:00], ["description", "A text-editor for OS X"], ["name", "TextMate 2"], ["updated_at", Thu, 09 May 2013 06:32:47 UTC +00:00]]
---
  def create
    @project = Project.new(params[:project])
    if @project.save

UPDATE "projects" SET "name" = 'TextMate 2 beta', "description" = '', "updated_at" = '2013-05-09 21:45:35.368680' WHERE "projects"."id" = 1
---
  def update
    if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_project
      @project = Project.for(current_user).find(params[:id])