app/controllers/tickets_controller.rb

  def create
    @ticket = @project.tickets.build(params[:ticket])
    @ticket.user = current_user

    if @ticket.save
---
INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 13 May 2013 20:06:00 UTC +00:00], ["description", nil], ["project_id", 1], ["title", nil], ["updated_at", Mon, 13 May 2013 20:06:00 UTC +00:00]]

  def update
    if @ticket.update_attributes(params[:ticket])
---
UPDATE "tickets" SET "title" = 'Make it really shiny!', "description" = '

  def find_project
    @project = Project.for(current_user).find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def find_ticket
    @ticket = @project.tickets.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]